207_morooka_takato/Laravel L-7/sample/app/Http/Controllers/UserController.php

    function index(Request $request)
    {

        $user= User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'testuser@mail.com' limit 1